Revit 2022 API
AnalyticalModelSketchComponent.GetAnalyticalAlignmentMethod Method
 Retrieves Analytical Alignment Method preset for Sketch Component.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public AnalyticalAlignmentMethod GetAnalyticalAlignmentMethod()
Visual Basic
Public Function GetAnalyticalAlignmentMethod As AnalyticalAlignmentMethod
Visual C++
public:
AnalyticalAlignmentMethod GetAnalyticalAlignmentMethod()
Return Value
 Indicates whether Alignment Method is at Auto-Detect or Projection
See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace